["The Treaty of Tordesillas in 1494 divided newly discovered lands between which two countries?", "What was the original purpose of the Magna Carta signed in 1215?", "What was the primary language of administration in the Mughal Empire?", "What year did the Berlin Wall officially fall?", "Which African club won the CAF Champions League in 2016?", "Which NBA team did Dirk Nowitzki play against in his final career game?", "Which ancient civilization is credited with the earliest known use of zero as a number?", "Which club did Pep Guardiola manage immediately before joining Bayern Munich?", "Which country has changed its capital city the most times in modern history?", "Which country has the highest number of time zones when including overseas territories?", "Which country has the longest written constitution still in use today?", "Which country was the first to grant women the right to vote at a national level?", "Which country won the UEFA European Championship in 2004?", "Which empire built the city of Machu Picchu?", "Which empire first introduced a standardized road system across three continents?", "Which franchise won the very first NBA championship in 1947?", "Which goalkeeper conceded the fewest goals at the 1994 FIFA World Cup?", "Which manager introduced the 'tiki-taka' style that dominated European football with Barcelona?", "Which player defeated Novak Djokovic in the 2021 US Open final, preventing a calendar Grand Slam?", "Which player has the most career titles without ever reaching world No.1?", "Which player holds the record for most minutes played in a single NBA game?", "Which player recorded the first 20-assist game in NBA Finals history?", "Which player scored the winning goal in the 1990 European Cup final between AC Milan and Benfica?", "Which team ended the Chicago Bulls' 72–10 season in the 1996 NBA Playoffs?", "Who was the first player to defeat Rafael Nadal at Roland Garros?", "Who was the runner-up to Stan Wawrinka in the 2014 Australian Open final?"]